---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.SurfaceAreaPerUnitLength
source: html/1ab56927-b127-3041-fc23-24740bf3e514.htm
---
# Autodesk.Revit.DB.SpecTypeId.SurfaceAreaPerUnitLength Property

Surface Area per Unit Length, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId SurfaceAreaPerUnitLength { get; }
```